---
type: Entity
namespace: Autodesk.Revit.DB.ExtensibleStorage
version: 2024
members: 13
tags: [revit-api, class]
---

# Entity

`Autodesk.Revit.DB.ExtensibleStorage.Entity` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Entity | — | `` |
| Constructor | Entity | 2012 | `public Entity ()` |
| Method | Clear | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Get | — | `` |
| Method | IsValid | 2012 | `public bool IsValid ()` |
| Method | ReadAccessGranted | 2012 | `public bool ReadAccessGranted ()` |
| Method | RecognizedField | 2012 | `public bool RecognizedField ( Field field )` |
| Method | Set | — | `` |
| Method | WriteAccessGranted | 2012 | `public bool WriteAccessGranted ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Schema | 2012 | `public Schema Schema { get ; }` |
| Property | SchemaGUID | 2012 | `public Guid SchemaGUID { get ; }` |